snlkuharlocal/src/Documents/ЗаявкаНаИзменениеСтатусаЖизненногоЦиклаНоменклатуры/ЗаявкаНаИзменениеСтатусаЖизненногоЦиклаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаИзменениеСтатусаЖизненногоЦиклаНоменклатуры</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйСтатус</name>
    <type>
      <types>EnumRef.ЖизненныйЦиклНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ЖизненныйЦиклНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаявкаНаИзменениеСтатусаЖизненногоЦиклаНоменклатуры/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	Автор = ПараметрыСеанса.Пользователь;
	КонечныйСтатус = Неопределено;
	Отработана = Ложь;
	Отменена = Ложь;
	Товары.Очистить();
	Комментарий = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	   Отказ = (ПометкаУдаления ИЛИ РежимЗаписи =  РежимЗаписиДокумента.ОтменаПроведения) И НЕ Отменена И Отработана;
КонецПроцедуры
